; domain
(define (domain taxi-planner)
  (:requirements :strips :typing)
  (:types taxi passenger location)
  (:predicates
    (at ?v - taxi ?l - location)
    (passenger-at ?p - passenger ?l - location)
    (in-taxi ?p - passenger ?v - taxi)
    (station ?l - location)
  )
  (:action move
    :parameters (?v - taxi ?from - location ?to - location)
    :precondition (at ?v ?from)
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )
  (:action pickup
    :parameters (?v - taxi ?p - passenger ?l - location)
    :precondition (and (at ?v ?l) (passenger-at ?p ?l))
    :effect (and (not (passenger-at ?p ?l)) (in-taxi ?p ?v))
  )
  (:action dropoff
    :parameters (?v - taxi ?p - passenger ?l - location)
    :precondition (and (at ?v ?l) (in-taxi ?p ?v) (station ?l))
    :effect (and (not (in-taxi ?p ?v)) (passenger-at ?p ?l))
  )
)

; problem
(define (problem taxi-case1)
  (:domain taxi-planner)
  (:objects
    taxi1 - taxi
    p1 - passenger
    st l1 - location
  )
  (:init
    (station st)
    (at taxi1 st)
    (passenger-at p1 l1)
  )
  (:goal (and
    (passenger-at p1 st)
  ))
)

; plan
1. (move taxi1 st l1)
   deleted: (at taxi1 st)
   added: (at taxi1 l1)
   goals met: 0 of 1
2. (pickup taxi1 p1 l1)
   deleted: (passenger-at p1 l1)
   added: (in-taxi p1 taxi1)
   goals met: 0 of 1
3. (move taxi1 l1 st)
   deleted: (at taxi1 l1)
   added: (at taxi1 st)
   goals met: 0 of 1
4. (dropoff taxi1 p1 st)
   deleted: (in-taxi p1 taxi1)
   added: (passenger-at p1 st)
   goals met: 1 of 1
